week6Projects/routes_controllers_demo/app/controllers/artworks_controller.rb

  def update
    artwork = Artwork.update(params[:id], artwork_params)
---
UPDATE "artworks" SET "title" = $1, "artist_id" = $2, "image_url" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "CcccCCCC"], ["artist_id", 1], ["image_url", "BBBBBBBB"], ["updated_at", "2022-02-03 06:08:30.409088"], ["id", 9]]

  def destroy
    artwork = Artwork.destroy(params[:id])
---
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 8]]