week6Projects/routes_controllers_demo/app/controllers/users_controller.rb

  def index # render plain: "I'm in the index action!"
    users = User.all
---
SELECT "users".* FROM "users" WHERE (users.username LIKE '%'davinci'%' )

  def update
    user = User.update(params[:id], user_params)
---
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Jill"], ["email", "jill@gmail.com"], ["updated_at", "2022-02-03 00:30:05.875040"], ["id", 2]]

  def destroy
    user = User.destroy(params[:id])
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]